let options = JSON.stringify([1980,1990,2000,2005].map(y => {
    return {key:'历史' + y,label:'历史' + y,selected: false };
}).concat(['rcp45_2030','rcp45_2050','rcp85_2030','rcp85_2050'].map(s => {
    return {key: s,label: s,selected: false };
})));
let menus = [
    {
        title: '产水量',open: false,type: 'chanshuiliang',
        options: JSON.parse(options),
    },
    {
        title: '防风固沙',open: false,type: 'fangfenggusha',
        options: JSON.parse(options),
    },
    {
        title: '固碳释氧',open: false,type: 'gutanshiyang',
        options: JSON.parse(options),
    },
    {
        title: '生境质量',open: false,type: 'shenghuozhiliang',
        options: JSON.parse(options),
    },
    {
        title: '土壤侵蚀',open: false,type: 'turangqinshi',
        options: JSON.parse(options),
    },
];

const getAllDatas = () => {
    let datas = {
        // 产水量
        chanshuiliang: {
            name: '产水量',
            lishi: `1982\t212.25
1983\t203.36
1984\t184.44
1985\t192.51
1986\t173.39
1987\t196.73
1988\t206.42
1989\t210.62
1990\t193.55
1991\t195.24
1992\t236.41
1993\t226.72
1994\t215.84
1995\t197.72
1996\t207.72
1997\t214.74
1998\t223.54
1999\t219.04
2000\t224.52
2001\t236.84
2002\t227.72
2003\t238.54
2004\t246.28
2005\t227.33`.splitSheet(),
            lishiTitle: ['年份','历史'],
            lishiImage: ['1980','1990','2000','2005'],
            lishiUnit: 'mm',
            weilai: `2006\t234.23\t234.23
2007\t238.54\t238.54
2008\t230.456\t247.26
2009\t236.454\t225.19
2010\t234.305\t210.64
2011\t227.564\t217.72
2012\t235.226\t224.86
2013\t239.554\t235.52
2014\t242.151\t228.84
2015\t238.766\t231.49
2016\t242.667\t244.53
2017\t245.365\t235.54
2018\t247.335\t247.41
2019\t234.82\t234.82
2020\t229.53\t229.53
2021\t242.151\t235.15
2022\t247.27\t247.27
2023\t250.54\t250.54
2024\t243.34\t243.34
2025\t238.667\t256.83
2026\t248.542\t252.29
2027\t241.84\t241.84
2028\t243.35\t243.35
2029\t239.25\t239.25
2030\t245.54\t245.54
2031\t250.536\t252.38
2032\t255.46\t255.46
2033\t254.454\t243.89
2034\t257.31\t257.31
2035\t262.668\t260.17
2036\t258.484\t258.42
2037\t263.35\t248.35
2038\t267.248\t255.68
2039\t278.365\t263.35
2040\t269.254\t257.47
2041\t270.331\t251.34
2042\t268.554\t261.43
2043\t264.554\t254.52
2044\t259.365\t247.64
2045\t263.45\t258.83
2046\t264.554\t253.72
2047\t270.154\t262.49
2048\t271.365\t257.63
2049\t272.665\t263.31
2050\t268.69\t259.72`.splitSheet(),
            weilaiTitle: ['年份','RCP4.5','RCP8.5'],
            weilaiUnit: 'mm',
            weilaiImage:  `RCP45_2030.tif
RCP4.5_2050.tif
RCP85_2030.tif
RCP8.5_2050.tif`.splitFiles(),
            legend: `${window.allUrls.base}/table/image/生境服务-产水量.png`
        },
        // 防风固沙
        fangfenggusha: {
            name: '防风固沙',
            lishi: `1982\t365.58 
1983\t349.25 
1984\t348.53 
1985\t340.09 
1986\t353.11 
1987\t322.77 
1988\t365.95 
1989\t312.15 
1990\t375.21 
1991\t365.79 
1992\t344.78 
1993\t353.78 
1994\t333.28 
1995\t312.78 
1996\t348.45 
1997\t313.10 
1998\t313.78 
1999\t296.01 
2000\t355.87 
2001\t338.77 
2002\t302.32 
2003\t316.99 
2004\t356.12 
2005\t322.36`.splitSheet(),
            lishiTitle: ['年份','历史'],
            lishiUnit: 't/km^2/a',
            lishiImage: `1980.tif
1990.tif
2000.tif
2005.tif`.splitFiles(),
            weilai: `2006\t333.71 \t377.12 
2007\t359.93 \t408.00 
2008\t363.50 \t345.00 
2009\t369.66 \t373.82 
2010\t463.62 \t404.03 
2011\t308.63 \t330.98 
2012\t361.19 \t345.98 
2013\t377.89 \t377.08 
2014\t349.81 \t389.12 
2015\t335.56 \t368.56 
2016\t337.89 \t349.75 
2017\t336.07 \t403.83 
2018\t302.90 \t330.67 
2019\t332.36 \t338.00 
2020\t350.68 \t400.61 
2021\t331.56 \t347.59 
2022\t384.25 \t400.32 
2023\t411.65 \t356.23 
2024\t375.04 \t435.47 
2025\t374.90 \t448.00 
2026\t396.24 \t376.00 
2027\t388.66 \t389.75 
2028\t349.14 \t408.52 
2029\t344.74 \t377.82 
2030\t353.33 \t375.00 
2031\t361.86 \t377.12 
2032\t393.01 \t408.00 
2033\t330.50 \t361.17 
2034\t349.74 \t383.62 
2035\t292.63 \t293.87 
2036\t345.26 \t414.79 
2037\t328.16 \t326.80 
2038\t394.40 \t412.97 
2039\t354.55 \t421.34 
2040\t350.18 \t422.01 
2041\t413.25 \t475.64 
2042\t373.45 \t412.18 
2043\t356.04 \t328.15 
2044\t385.28 \t385.30 
2045\t311.02 \t355.77 
2046\t387.40 \t404.85 
2047\t362.85 \t518.22 
2048\t398.39 \t385.20 
2049\t316.85 \t356.21 
2050\t373.90 \t403.57`.splitSheet(),
            weilaiTitle: ['年份','RCP4.5','RCP8.5'],
            weilaiUnit: 't/km^2/a',
            weilaiImage: `RCP4.5_2030.tif
RCP4.5_2050.tif
RCP8.5_2030.tif
RCP8.5_2050.tif`.splitFiles(),
            legend: `${window.allUrls.base}/table/image/生境服务-防风固沙.png`
        },
        // 固碳释氧
        gutanshiyang: {
            name: '固碳释氧',
            lishi: `1982\t256.7941178
1983\t243.1168788
1984\t249.9554983
1985\t258.4650685
1986\t256.477799
1987\t276.9577568
1988\t285.0061523
1989\t255.052667
1990\t275.8052847
1991\t277.99732
1992\t290.6386112
1993\t274.6495213
1994\t296.2919407
1995\t274.3733768
1996\t274.4423816
1997\t275.031925
1998\t285.1332419
1999\t291.8974553
2000\t278.2495308
2001\t263.4182659
2002\t314.2310265
2003\t288.670556
2004\t290.556065
2005\t302.0627548`.splitSheet(),
            lishiTitle: ['年份','历史'],
            lishiUnit: 't/km^2/a',
            lishiImage: `1980.tif
1990.tif
2000.tif
2005.tif`.splitFiles(),
            weilai: `2006\t216.51 \t182.67 
2007\t193.99 \t181.36 
2008\t214.68 \t180.02 
2009\t238.90 \t173.09 
2010\t244.40 \t234.58 
2011\t222.83 \t220.20 
2012\t222.83 \t206.51 
2013\t225.91 \t211.31 
2014\t230.61 \t189.99 
2015\t236.12 \t201.48 
2016\t238.90 \t199.79 
2017\t223.85 \t202.95 
2018\t225.61 \t204.57 
2019\t218.56 \t204.21 
2020\t225.61 \t211.85 
2021\t225.21 \t200.61 
2022\t220.71 \t205.42 
2023\t225.55 \t205.42 
2024\t220.72 \t220.15 
2025\t238.90 \t200.95 
2026\t244.40 \t217.15 
2027\t222.83 \t184.75 
2028\t222.83 \t204.57 
2029\t225.91 \t194.49 
2030\t230.61 \t203.75 
2031\t236.12 \t200.61 
2032\t226.95 \t205.42 
2033\t220.71 \t205.42 
2034\t220.95 \t203.95 
2035\t225.16 \t200.95 
2036\t216.51 \t172.17 
2037\t214.41 \t194.49 
2038\t218.44 \t203.75 
2039\t227.57 \t168.21 
2040\t212.44 \t221.62 
2041\t222.44 \t173.02 
2042\t210.01 \t203.95 
2043\t224.67 \t184.75 
2044\t224.73 \t205.42 
2045\t218.05 \t203.95 
2046\t220.71 \t168.55 
2047\t208.11 \t198.97 
2048\t226.31 \t196.73 
2049\t219.31 \t210.69 
2050\t223.51 \t192.25`.splitSheet(),
            weilaiTitle: ['年份','RCP4.5','RCP8.5'],
            weilaiUnit: 't/km^2/a',
            weilaiImage: `RCP4.5_2030.tif
RCP4.5_2050.tif
RCP8.5_2030.tif
RCP8.5_2050.tif`.splitFiles(),
            legend: `${window.allUrls.base}/table/image/生境服务-固碳释氧.png`
        },
        // 生境质量
        shenghuozhiliang: {
            name: '生境质量',
            lishiImage: `1980.tif
1990.tif
2000.tif
2005.tif`.splitFiles(),
            weilaiImage: `RCP4.5_2030.tif
RCP4.5_2050.tif
RCP8.5_2030.tif
RCP8.5_2050.tif`.splitFiles(),
            '咸海流域': `差\t85.24062312\t85.24003169\t85.28641707\t85.28787876\t85.42188098\t85.42291177\t85.42320749\t85.42225274\t85.42273012\t85.47726463\t85.29868934\t85.35259862\t85.24478006\t85.28388235\t85.4213149\t85.559567\t85.99638384\t86.05108311\t86.06564085\t86.06623229\t85.95534671\t86.03239377\t86.05339815\t86.72498925\t86.52488996\t86.59183193\t86.6746497
较差\t21.61679782\t21.61752444\t21.56879866\t21.56879866\t21.61903682\t21.61972965\t22.04172681\t21.61961136\t21.83066909\t22.11895975\t21.61882348\t21.61807785\t21.61956911\t21.61858057\t21.61757513\t21.65665207\t21.67028042\t21.69659082\t21.73487355\t21.8396251\t21.86601999\t21.8550531\t21.91701012\t21.9149063\t21.93112851\t21.90382957\t21.90499554
中等\t21.37904103\t21.37925226\t21.40588372\t21.4056556\t21.37878756\t21.43471195\t21.87654753\t21.40103396\t21.63879074\t21.3026868\t21.37862914\t21.37797223\t21.37928606\t21.37815388\t21.37779057\t21.34325078\t21.29406875\t21.29700903\t21.26112584\t21.17161641\t21.18074985\t21.13617256\t21.11733114\t21.12776574\t21.17854464\t21.17651687\t21.15501399
良好\t5.773392059\t5.773349814\t5.73311535\t5.732498568\t5.592615792\t5.592429912\t5.590148664\t5.592548199\t5.591348432\t5.590824589\t5.716027109\t5.6637316\t5.768322618\t5.731619865\t5.595843336\t5.487838895\t5.061853765\t4.983598494\t4.920154439\t4.819331706\t4.792345382\t4.713380389\t4.626980216\t3.892452007\t3.85551268\t3.81434037\t3.755915062
优等\t14.45329744\t14.45299327\t14.46893666\t14.46831988\t14.45083031\t14.3933682\t13.53152097\t14.42770521\t13.97961309\t13.9734157\t14.45098239\t14.45077117\t14.45119362\t14.4509148\t14.45062753\t14.41584272\t14.44056469\t14.43487002\t14.48135679\t14.56634597\t14.66868954\t14.72615165\t14.74843184\t14.80303817\t14.97307567\t14.97663273\t14.97257718
`.splitSheetHero(),
            咸海流域Total: 148.463151469232,
            '锡尔河流域': `差\t8.110319882\t8.10998192\t8.109990369\t8.110488864\t8.110818377\t8.111384465\t8.111283076\t8.110733887\t8.111008482\t8.123889086\t8.111002145\t8.112166004\t8.109838286\t8.11134222\t8.112989788\t8.09728297\t8.097865956\t8.094080773\t8.088893045\t8.062396767\t8.01456659\t8.011617866\t7.972802845\t7.955930056\t7.859103732\t7.86900604\t7.876753836
较差\t8.242885765\t8.242928011\t8.242497108\t8.242497108\t8.243671529\t8.244060186\t8.580738663\t8.244246065\t8.412492364\t8.581000584\t8.243599712\t8.243096992\t8.244102431\t8.2434772\t8.242716784\t8.259775453\t8.270057969\t8.285207149\t8.295836077\t8.325095201\t8.353543214\t8.360598186\t8.402429524\t8.3949352\t8.387128261\t8.364755128\t8.358392979
中等\t8.141454699\t8.141758866\t8.142054583\t8.141919398\t8.141285718\t8.153359437\t8.515165443\t8.141235024\t8.328200233\t8.140297177\t8.141258259\t8.140723855\t8.141792662\t8.141108288\t8.140339422\t8.132895793\t8.115296384\t8.113851593\t8.096666188\t8.065041325\t8.059532532\t8.038798519\t8.025263111\t8.018909412\t8.038646435\t8.042110553\t8.033264379
良好\t0.831126408\t0.831168653\t0.831523514\t0.831498167\t0.831067264\t0.83101657\t0.829808353\t0.830999672\t0.830404012\t0.830458931\t0.831022906\t0.831012345\t0.831033468\t0.83101657\t0.831008121\t0.859388541\t0.862827312\t0.864060876\t0.869654159\t0.874520823\t0.875669896\t0.875382628\t0.876641539\t0.890160048\t0.89014315\t0.890523358\t0.891165487
优等\t7.360076406\t7.360025712\t7.359797587\t7.359459624\t7.359020273\t7.346042504\t6.648867626\t7.358648514\t7.00375807\t7.010217383\t7.35898014\t7.358863965\t7.359096315\t7.358918884\t7.358809046\t7.336520404\t7.33981554\t7.32866277\t7.334813692\t7.358809046\t7.382550928\t7.399465963\t7.408726142\t7.425928445\t7.510841583\t7.519468081\t7.52628648
`.splitSheetHero(),
            锡尔河流域Total: 32.6858631612467,
            '阿姆河流域': `差\t38.69511941\t38.69498423\t38.74174137\t38.74252714\t38.87581964\t38.8761407\t38.87625899\t38.87594637\t38.87610268\t38.9015893\t38.75231538\t38.80477987\t38.69985089\t38.73711973\t38.87244001\t39.01798366\t39.45602561\t39.52087221\t39.56521292\t39.63526415\t39.38593214\t39.71874095\t39.79089599\t40.50229065\t40.44704219\t40.48460675\t40.54021852
较差\t8.321639532\t8.322028189\t8.290876474\t8.290876474\t8.322492888\t8.322628073\t8.344198544\t8.322543582\t8.333371063\t8.419986688\t8.322478102\t8.322353478\t8.322602726\t8.322391499\t8.322315457\t8.340278177\t8.34079357\t8.343767642\t8.353391131\t8.377901878\t8.329412675\t8.306701579\t8.31022484\t8.296655637\t8.299046723\t8.289980872\t8.289364091
中等\t9.143226941\t9.143201594\t9.162473919\t9.162397877\t9.143243839\t9.17099058\t9.149200432\t9.165616972\t9.157408702\t9.069179306\t9.143283972\t9.143248064\t9.143319881\t9.142990367\t9.14350576\t9.121969085\t9.090614592\t9.100812618\t9.087657418\t9.05589737\t8.954854962\t9.077552333\t9.08265557\t9.103702199\t9.145618027\t9.151185964\t9.152706796
良好\t3.828509457\t3.82848411\t3.788393281\t3.787801846\t3.647851477\t3.647716292\t3.646930529\t3.647851477\t3.647391003\t3.646795344\t3.771307152\t3.719022205\t3.8235921\t3.786906245\t3.651138165\t3.508146132\t3.074827211\t2.993851339\t2.923022799\t2.816978542\t2.75015486\t2.709624679\t2.620715132\t1.869821078\t1.835078509\t1.79280782\t1.733512258
优等\t3.135668952\t3.135466174\t3.14067925\t3.140560963\t3.134756453\t3.106688647\t3.1075758\t3.112205889\t3.109890844\t3.086613661\t3.134779688\t3.134760677\t3.134798698\t3.134756453\t3.134764902\t3.135787239\t3.161903309\t3.164860483\t3.194880023\t3.238122355\t3.283671283\t3.311544759\t3.319672763\t3.351694732\t3.397378845\t3.40558289\t3.408362634
`.splitSheetHero(),
            阿姆河流域Total: 63.1241642952481,
            columns: ["类型", "1980", "1981", "1982", "1983", "1984", "1985", "1986", "1987",
                "1988", "1989", "1990", "1991", "1992", "1993", "1994", "1995",
                "1996", "1997", "1998", "1999", "2000", "2001", "2002", "2003", "2004", "2005", "2006"].map(t => {
                return {
                    title: t,key: t,width: 150
                }
            }),
            legend: `${window.allUrls.base}/table/image/生境服务-生境质量.png`
        },
        // 土壤侵蚀
        turangqinshi: {
            name: '土壤侵蚀',
            lishi: `1982\t1556.77 
1983\t1556.08 
1984\t1556.11 
1985\t1553.67 
1986\t1556.31 
1987\t1559.24 
1988\t1557.87 
1989\t1555.86 
1990\t1555.08 
1991\t1559.98 
1992\t1562.05 
1993\t1562.35 
1994\t1560.89 
1995\t1560.99 
1996\t1562.24 
1997\t1564.67 
1998\t1565.55 
1999\t1566.02 
2000\t1565.05 
2001\t1570.19 
2002\t1575.94 
2003\t1582.28 
2004\t1582.18 
2005\t1578.46`.splitSheet(),
            lishiTitle: ['年份','历史'],
            lishiUnit: 't/km^2/a',
            lishiImage: `1980.tif
1990.tif
2000.tif
2005.tif`.splitFiles(),
            weilai: `2006\t1566.52 \t1566.52 
2007\t1568.85 \t1561.57 
2008\t1565.45 \t1560.22 
2009\t1563.94 \t1555.83 
2010\t1563.06 \t1558.41 
2011\t1564.12 \t1558.30 
2012\t1563.14 \t1555.11 
2013\t1561.20 \t1553.70 
2014\t1561.49 \t1553.46 
2015\t1560.67 \t1550.43 
2016\t1560.22 \t1551.36 
2017\t1562.79 \t1547.94 
2018\t1560.53 \t1546.77 
2019\t1558.09 \t1545.52 
2020\t1558.67 \t1544.37 
2021\t1557.29 \t1541.53 
2022\t1555.56 \t1542.17 
2023\t1555.17 \t1538.82 
2024\t1554.02 \t1537.49 
2025\t1550.01 \t1535.23 
2026\t1552.91 \t1534.06 
2027\t1550.51 \t1532.31 
2028\t1549.40 \t1530.63 
2029\t1548.39 \t1528.88 
2030\t1547.09 \t1527.89 
2031\t1544.45 \t1526.88 
2032\t1545.25 \t1525.93 
2033\t1543.36 \t1524.70 
2034\t1542.78 \t1520.66 
2035\t1541.88 \t1523.46 
2036\t1540.31 \t1520.61 
2037\t1539.43 \t1518.75 
2038\t1536.40 \t1513.12 
2039\t1537.76 \t1519.47 
2040\t1539.94 \t1507.59 
2041\t1536.83 \t1505.81 
2042\t1535.47 \t1503.52 
2043\t1534.35 \t1499.67 
2044\t1533.69 \t1497.41 
2045\t1532.15 \t1502.96 
2046\t1532.44 \t1500.28 
2047\t1531.51 \t1496.32 
2048\t1530.92 \t1495.12 
2049\t1528.77 \t1491.32 
2050\t1526.19 \t1494.22`.splitSheet(),
            weilaiTitle: ['年份','RCP4.5','RCP8.5'],
            weilaiUnit: 't/km^2/a',
            weilaiImage: `RCP4.5_2030.tif
RCP4.5_2050.tif
RCP8.5_2030.tif
RCP8.5_2050.tif`.splitFiles(),
            legend: `${window.allUrls.base}/table/image/生境服务-土壤侵蚀.png`
        }
    };
    let columns = datas.shenghuozhiliang.columns;
    datas.shenghuozhiliang.咸海流域Data = datas.shenghuozhiliang.咸海流域.map(line => {
        let obj = {};
        for (let i = 0;i < line.length;i++) {
            obj[columns[i].key] = line[i];
        }
        return obj;
    });
    datas.shenghuozhiliang.锡尔河流域Data = datas.shenghuozhiliang.锡尔河流域.map(line => {
        let obj = {};
        for (let i = 0;i < line.length;i++) {
            obj[columns[i].key] = line[i];
        }
        return obj;
    });
    datas.shenghuozhiliang.阿姆河流域Data = datas.shenghuozhiliang.阿姆河流域.map(line => {
        let obj = {};
        for (let i = 0;i < line.length;i++) {
            obj[columns[i].key] = line[i];
        }
        return obj;
    });
    let defaultEchartOptions = {
        "tooltip": {
            "trigger": "axis",
            "axisPointer": {
                "type": "shadow",
                "label": {
                    "show": true
                }
            }
        },
        "grid": {
            "left": "3%",
            "right": "4%",
            "bottom": "3%",
            "containLabel": true
        },
        "toolbox": {
            "feature": {
                "saveAsImage": {}
            }
        },
    }
    return {
        datas,
        defaultEchartOptions,
        // ind 是父级菜单的索引（见 menus）0，1，2，3，4
        // key 是 menus[ind].options 中某一项的 key
        menus2TypeTarInd(ind,key) {
            let sind = -1;
            menus[ind].options.forEach((o,_sind) => {
                if (o.key === key) sind = _sind;
            });
            return {
                type: menus[ind].type,
                tar: key.substring(0,2) === "历史" ? 'lishi' : 'weilai',
                ind: sind,
            }
        },
        // 获取除 生境质量 外的 历史和未来 的表格的 column 和 tableData
        // type = chanshuiliang,fangfenggusha,gutanshiyang,turangqinshi
        getColumnsAndData(type) {
            let listData = [];
            datas[type].lishi.forEach((arr,ind) => {
                let key = datas[type].lishiTitle[ind];
                arr.forEach((arr_,ind_) => {
                    if (ind) {
                        listData[ind_][key] = arr_;
                    } else {
                        listData.push({
                            [key]: arr_
                        })
                    }
                });
            });
            let weilaiData = [];
            datas[type].weilai.forEach((arr,ind) => {
                let key = datas[type].weilaiTitle[ind];
                arr.forEach((arr_,ind_) => {
                    if (ind) {
                        weilaiData[ind_][key] = arr_;
                    } else {
                        weilaiData.push({
                            [key]: arr_
                        })
                    }
                });
            });
            return {
                lishiColumns:　datas[type].lishiTitle.clone().map((_,ind) => {
                        return {
                            title: !ind ? _ : `${_}(${datas[type].lishiUnit})`,
                            key: _
                        }
                    }),
                weilaiColumns: datas[type].weilaiTitle.clone().map((_,ind) => {
                    return {
                        title: !ind ? _ : `${_}(${datas[type].weilaiUnit})`,
                        key: _
                    }
                }),
                lishiData: listData,
                weilaiData: weilaiData,
                lishiOptions: {
                    ...defaultEchartOptions,
                    "xAxis": {
                        "type": "category",
                        "boundaryGap": false,
                        "data": datas[type].lishi[0]
                    },
                    "legend": {
                        "data": ["历史"]
                    },
                    "yAxis": {
                        "type": "value",
                        name: "值(" + datas[type].lishiUnit + ')',
                    },
                    "series": [{name: '历史',data: datas[type].lishi[1],type:'line',smooth:true}]
                },
                weilaiOptions: {
                    ...defaultEchartOptions,
                    "xAxis": {
                        "type": "category",
                        "boundaryGap": false,
                        "data": datas[type].weilai[0]
                    },
                    "legend": {
                        "data": ['RCP4.5','RCP8.5']
                    },
                    "yAxis": {
                        "type": "value",
                        name: "值(" + datas[type].lishiUnit + ')',
                    },
                    "series": [
                        {name: 'RCP4.5',data: datas[type].weilai[1]},
                        {name: 'RCP8.5',data: datas[type].weilai[2]},
                    ].map(_ => { return {type:'line',smooth:true,..._} })
                }
            }
        },
        getLayer(type,tar,ind) {
            if (tar === "weilai") {
                ind -= datas[type].lishiImage.length;
            }
            let layer = `${type}_${tar}_${datas[type][tar + 'Image'][ind]}`;
            return {
                url: window.allUrls.geoserver + "shengtaifuwu/wms",
                layer: `shengtaifuwu:${layer}`,
                param: {
                    // styles: 'turang:turang',
                    service: 'WMS',
                    transparent: true,
                    format: 'image/png'
                }
            }
        },
        // type = chanshuiliang,fangfenggusha,gutanshiyang,turangqinshi,shenghuozhiliang
        // tar = lishi、weilai
        // ind = 0,1,2,3
        getImageLegend(type,tar,ind) {
            return datas[type].legend;
        },
        // tar = ['咸海流域','锡尔河流域','阿姆河流域']
        getShenghuozhiliangEchart(tar) {
            let legend = ['差','较差','中等','良好','优等'];
            let color = ['#ff7c80','#ffc000','#66ff66','#85c0fb','#0066ff']
            let series = [];
            let total = datas.shenghuozhiliang[tar + 'Total'];
            datas.shenghuozhiliang[tar].forEach((line,ind) => {
                series.push({
                    color: color[ind],
                    name: legend[ind],
                    type: 'bar',
                    stack: '总量',
                    data: JSON.parse(JSON.stringify(line)).map(_ => (_ / total * 100).toFixed(2))
                });
            });
            return {
                tooltip: {
                    trigger: 'axis',
                    axisPointer: {            // 坐标轴指示器，坐标轴触发有效
                        type: 'shadow'        // 默认为直线，可选为：'line' | 'shadow'
                    },
                    formatter: function(params) {
                        var result = params[0].name + "<br>";
                        params.forEach(function(item) {
                            if (item.value) {
                                result += item.marker + " " + item.seriesName + " : " + item.value + "%</br>";
                            } else {
                                result += item.marker + " " + item.seriesName + " :  - </br>";
                            }
                        });
                        return result;
                    },
                },
                legend: {
                    data: legend.reverse()
                },
                grid: {
                    left: '3%',
                    right: '4%',
                    bottom: '3%',
                    containLabel: true
                },
                xAxis: {
                    type: 'category',
                    data: ["1980", "1981", "1982", "1983", "1984", "1985", "1986", "1987",
                        "1988", "1989", "1990", "1991", "1992", "1993", "1994", "1995",
                        "1996", "1997", "1998", "1999", "2000", "2001", "2002", "2003", "2004", "2005", "2006"]
                },
                yAxis: {
                    type: 'value',
                    axisLabel: {
                        show: true,
                        interval: 'auto',
                        formatter: '{value} %'
                    },
                    show: true,
                    max: 100
                },
                series: series
            };
        }
    };
}

export {
    menus,
    getAllDatas
}